# Practice Using SQL in Python Part 1

This notebook practices creating datasets and answering queries using SQL. 

- The first cell installs the SQL package
- The second cell loads the SQL extension
- The third cell connects to the database SQLite
- The following cells create 3 data sets 
- The following cells answer specific queries, based on this website: https://www.programmerinterview.com/database-sql/practice-interview-question-1/

In [82]:
# Install the necessary package
!pip install ipython-sql

Requirement already satisfied: ipython-sql in ./opt/anaconda3/lib/python3.9/site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (2.0.31)
Requirement already satisfied: ipython-genutils in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: ipython in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (8.3.0)
Requirement already satisfied: six in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in ./opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: typing-extensions>=4.6.0 in ./opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: pexpect>4.3 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: appnope in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: matplotlib-inline in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pygments>=2.4.0 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: decorator in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (61.2.0)
Requirement already satisfied: traitlets>=5 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in ./opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in ./opt/anaconda3/lib/python3.9/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in ./opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in ./opt/anaconda3/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: executing in ./opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in ./opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in ./opt/anaconda3/lib/python3.9/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [83]:
# Load the ipython-sql extension:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [84]:
# Connect to a database. I will be using SQLite:
%sql sqlite:///my_database.db

### Create table: salesperson

In [42]:
%%sql
CREATE TABLE salesperson (
    ID INTEGER,
    name TEXT,
    age INTEGER,
    salary INTEGER );

 * sqlite:///my_database.db
(sqlite3.OperationalError) table salesperson already exists
[SQL: CREATE TABLE salesperson (
    ID INTEGER,
    name TEXT,
    age INTEGER,
    salary INTEGER );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### Add data to table: salesperson

In [38]:
%%sql
INSERT INTO salesperson (ID, name, age, salary) VALUES (1, 'Abe', 61, 140000);
INSERT INTO salesperson (ID, name, age, salary) VALUES (2, 'Bob', 34, 44000);
INSERT INTO salesperson (ID, name, age, salary) VALUES (5, 'Chris', 34, 40000);
INSERT INTO salesperson (ID, name, age, salary) VALUES (7, 'Dan', 41, 52000);
INSERT INTO salesperson (ID, name, age, salary) VALUES (8, 'Ken', 57, 115000);
INSERT INTO salesperson (ID, name, age, salary) VALUES (11, 'Joe', 58, 38000);

SELECT * FROM salesperson;

 * sqlite:///my_database.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Abe', 61, 140000),
 (2, 'Bob', 34, 44000),
 (5, 'Chris', 34, 40000),
 (7, 'Dan', 41, 52000),
 (8, 'Ken', 57, 115000),
 (11, 'Joe', 58, 38000)]

### Create table and add data: customer

In [43]:
%%sql
CREATE TABLE customer (
    ID INTEGER,
    name TEXT,
    city TEXT,
    industry_type TEXT );

INSERT INTO customer (ID, name, city, industry_type) VALUES (4, 'Samsonic', 'pleasant', 'J');
INSERT INTO customer (ID, name, city, industry_type) VALUES (6, 'Panasung', 'oaktown', 'J');
INSERT INTO customer (ID, name, city, industry_type) VALUES (7, 'Samony', 'jackson', 'B');
INSERT INTO customer (ID, name, city, industry_type) VALUES (9, 'Orange', 'Jackson', 'B');

SELECT * FROM customer;

 * sqlite:///my_database.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(4, 'Samsonic', 'pleasant', 'J'),
 (6, 'Panasung', 'oaktown', 'J'),
 (7, 'Samony', 'jackson', 'B'),
 (9, 'Orange', 'Jackson', 'B')]

### Create table and add data: orders

In [44]:
%%sql
CREATE TABLE orders (
    Number INTEGER,
    order_date TEXT,
    cust_id INTEGER,
    salesperson_id INTEGER,
    Amount INTEGER);

INSERT INTO orders (Number, order_date, cust_id, salesperson_id, Amount) VALUES (10, '8/2/96', 4, 2, 540);
INSERT INTO orders (Number, order_date, cust_id, salesperson_id, Amount) VALUES (20, '1/30/99', 4, 8, 1800);
INSERT INTO orders (Number, order_date, cust_id, salesperson_id, Amount) VALUES (30, '7/14/95', 9, 1, 460);
INSERT INTO orders (Number, order_date, cust_id, salesperson_id, Amount) VALUES (40, '1/29/98', 7, 2, 2400);
INSERT INTO orders (Number, order_date, cust_id, salesperson_id, Amount) VALUES (50, '2/3/98', 6, 7, 600);
INSERT INTO orders (Number, order_date, cust_id, salesperson_id, Amount) VALUES (60, '3/2/98', 6, 7, 720);
INSERT INTO orders (Number, order_date, cust_id, salesperson_id, Amount) VALUES (70, '5/6/98', 9, 7, 150);

SELECT * FROM orders;

 * sqlite:///my_database.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(10, '8/2/96', 4, 2, 540),
 (20, '1/30/99', 4, 8, 1800),
 (30, '7/14/95', 9, 1, 460),
 (40, '1/29/98', 7, 2, 2400),
 (50, '2/3/98', 6, 7, 600),
 (60, '3/2/98', 6, 7, 720),
 (70, '5/6/98', 9, 7, 150)]

## Given the tables above, find the following:

### a. The names of all salespeople that have an order with Samsonic.

In [85]:
%%sql
SELECT salesperson.name 
    FROM salesperson
    INNER JOIN orders on salesperson.ID = orders.salesperson_id
    WHERE cust_id = 4;

 * sqlite:///my_database.db
Done.

[('Bob',), ('Ken',)]

### b. The names of all salespeople that do not have any order with Samsonic.

In [88]:
%%sql
SELECT salesperson.name
    FROM salesperson
    WHERE salesperson.ID NOT IN (
    SELECT orders.salesperson_id
    FROM orders
    INNER JOIN customer on orders.cust_id = customer.id 
    WHERE customer.name = 'Samsonic');

 * sqlite:///my_database.db
Done.

[('Abe',), ('Chris',), ('Dan',), ('Joe',)]

### c. The names of salespeople that have 2 or more orders.

In [89]:
%%sql
SELECT salesperson.name
    FROM salesperson
    INNER JOIN orders on salesperson.ID = orders.salesperson_id 
    GROUP BY salesperson_id 
    HAVING COUNT(salesperson_id) > 1

 * sqlite:///my_database.db
Done.

[('Bob',), ('Dan',)]

### d. Write a SQL statement to insert rows into a table called highAchiever(Name, Age), where a salesperson must have a salary of 100,000 or greater to be included in the table.

In [96]:
%%sql
CREATE TABLE highAchiever(
    Name TEXT, 
    Age INTEGER);

 * sqlite:///my_database.db
Done.
Done.

[]

In [97]:
%%sql
-- inserting rows into the table
INSERT INTO highAchiever (Name, Age) 
SELECT name, age FROM salesperson where salary > 100000;
    
Select * FROM highAchiever

 * sqlite:///my_database.db
Done.
Done.

[('Abe', 61), ('Ken', 57)]